docker-performance/results/ab_output.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking lab104-webapp (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        lab104-webapp
Server Port:            3000

Document Path:          /
Document Length:        19 bytes

Concurrency Level:      10
Time taken for tests:   0.346 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      60000 bytes
HTML transferred:       9500 bytes
Requests per second:    1444.11 [#/sec] (mean)
Time per request:       6.925 [ms] (mean)
Time per request:       0.692 [ms] (mean, across all concurrent requests)
Transfer rate:          169.23 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3    7   3.0      6      26
Waiting:        2    6   2.9      6      26
Total:          3    7   3.0      6      27

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      7
  75%      8
  80%      8
  90%     10
  95%     11
  98%     17
  99%     22
 100%     27 (longest request)